{
  "header": {
    "title": "الدعاء النبوي الجامع",
    "subtitle": "Dhuaa thah · النبوية الجامعة الأدعية"
  },
  "duas": {
    "01": [
      {
        "label": "ދާޔަތަށާއި، ތަޤްވާވެރިކަމަށާއި، ނަފްސު ރައްކާތެރިކުރުމަށާއި،",
        "text": "اللهُمَّ إِنِّي أَسْأَلُكَ الـْهُدَى وَالتُّـقَى وَالْعَفَافَ وَالْغِنَى",
        "translation": "އޭ اللهُ، ތިމަންނާ ކަލާނގެ ހަޟްރަތުން ހިދާޔަތަށާއި، ތަޤްވާވެރިކަމަށާއި، ނަފްސު ރައްކާތެރިކުރުމަށާއި، އަދި ފުދުންތެރިކަމަށް އެދި ދަންނަވަމެވެ."
      }
    ],
    "02": [
      {
        "label": "ފާފަތަކާއި، ނޭނގުމުގައި ކުރެވިފައިވާ ކަންތައްތައް ފުއްސަވައިދެއްވުން އެދި ކުރާ ދުޢާ",
        "text": "اللهُمَّ اغْفِرْ لِي خَطِيئَـتِـي وَجَهْـلِـي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي،",
        "translation": "އޭ اللهُ، ތިމަންގެ ފާފަތަކާއި، ތިމަންގެ ޖާހިލުކަމާއި، ތިމަންގެ ކަންތަކުގައި ތިމަން ހައްދު ފަހަނައަޅާ ދިއުމާއި، އަދި ތިމަންނާ ވުރެ ކަލާނގެ ބޮޑަށް ދެނެވަޑައިގަންނަވާ ކަންތައްތައް ފުއްސަވައި ދެއްވާނދޭ."
      }
    ],
    "03": [
      {
        "label": "ތެދުމަގު ދެއްކެވުމަށާއި (ބަހާއި ޢަމަލުގައި) ސީދާކަން ދެއްވުމަށް އެދި ކުރާ ދުޢާ",
        "text": "اللهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي، وَخَطَئي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي،",
        "translation": "އޭ اللهُ، ތިމަންގެ ސީރިއަސްކަމާއި، ތިމަންގެ (މަޖަލާއި)، ތިމަންގެ ގޯހުން ކުރެވިފައިވާ ކަންތަކާއި، ތިމަން ގަސްދުގައި ކޮށްފައިވާ ކަންތައް ފުއްސަވައި ދެއްވާނދޭ، އަދި އެ ހުރިހާ ކަމެއް ތިމަންގެ ފަރާތުން ހިނގާފައިވެއެވެ."
      }
    ],
    "04": [
      {
        "label": "ކަންތަކާއި، ސިއްރުގައި ކޮށްފައިވާ ކަންތަކާއި، ފާޅުގައި",
        "text": "اللهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْـمُـقَدِّمُ وَأَنْتَ الـْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "translation": "އޭ اللهُ، ތިމަން ކުރިން ކޮށްފައިވާ ކަންތަކާއި، ފަހުން ކޮށްފައިވާ ކަންތަކާއި، ސިއްރުގައި ކޮށްފައިވާ ކަންތަކާއި، ފާޅުގައި ކޮށްފައިވާ ކަންތަކާއި، އަދި ތިމަންނާ ވުރެ ކަލާނގެ ބޮޑަށް ދެނެވަޑައިގަންނަވާ ކަންތައްތައް ފުއްސަވައި ދެއްވާނދޭ. އެކަލާނގެއީ އިސްކުރައްވާ ފަރާތެވެ، އަދި އެކަލާނގެއީ ފަހަށް ލައްވާ ފަރާތެވެ، އަދި އެކަލާނގެއީ ހުރިހާ ކަމެއްގެ މައްޗަށް ކުޅަދުންވަންތަ ފަރާތެވެ."
      },

      {
        "label": "ކަންތަކާއި، ސިއްރުގައި ކޮށްފައިވާ ކަންތަކާއި، ފާޅުގައި",
        "text": "اللهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْـمُـقَدِّمُ وَأَنْتَ الـْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "translation": "އޭ اللهُ، ތިމަން ކުރިން ކޮށްފައިވާ ކަންތަކާއި، ފަހުން ކޮށްފައިވާ ކަންތަކާއި، ސިއްރުގައި ކޮށްފައިވާ ކަންތަކާއި، ފާޅުގައި ކޮށްފައިވާ ކަންތަކާއި، އަދި ތިމަންނާ ވުރެ ކަލާނގެ ބޮޑަށް ދެނެވަޑައިގަންނަވާ ކަންތައްތައް ފުއްސަވައި ދެއްވާނދޭ. އެކަލާނގެއީ އިސްކުރައްވާ ފަރާތެވެ، އަދި އެކަލާނގެއީ ފަހަށް ލައްވާ ފަރާތެވެ، އަދި އެކަލާނގެއީ ހުރިހާ ކަމެއްގެ މައްޗަށް ކުޅަދުންވަންތަ ފަރާތެވެ."
      }
    ]
  },
  "footer": {
    "title": "الدعاء النبوي الجامع",
    "text": "الدعاء النبوي الجامع · Prophetic Supplications"
  }
}
