{
  "header": {
    "title": "",
    "subtitle": ""
  },
  "duas": {
    "01": [
      {
        "label": "ނަބަވީ ޖާމިޢު ދުޢާތަކުގެ މަތިވެރިކަމާއި އޭގެ ދަރަޖަ (ދަރުސް)",
        "text": "",
        "translation": ""
      }
    ],
    "02": [
      {
        "label": "ތެދުމަގަށާއި، ތަޤުވާވެރިކަމަށާއި، ޢިއްފަތްތެރިކަމަށާއި، ފުދުންތެރިކަމަށް އެދި ކުރާ ދުޢާ",
        "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الـهُدَى وَالتُّـقَى وَالعَفَافَ وَالغِنَى",
        "translation": ""
      }
    ],
    "03": [
      {
        "label": "ފާފަތަކާއި، ނޭނގުމުގައި ކުރެވިފައިވާ ކަންތައްތައް ފުއްސަވައިދެއްވުން އެދި ކުރާ ދުޢާ",
        "text": "اللَّهُمَّ اغْفِرْ لِي خَطِيئَـتِـي وَجَهْـلِـي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي، وَخَطَـئِـي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْـمُـقَدِّمُ وَأَنْتَ الـْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "translation": ""
      }
    ],
    "04": [
      {
        "label": "ތެދުމަގު ދެއްކެވުމަށާއި (ބަހާއި ޢަމަލުގައި) ސީދާކަން ދެއްވުމަށް އެދި ކުރާ ދުޢާ",
        "text": "اللهُمَّ إِنِّي أَسْأَلُكَ الـهُدَى وَالسَّدَادَ",
        "translation": ""
      }
    ],
    "05": [
      {
        "label": "ދީން ރައްކާތެރިކޮށްދެއްވުމަށް އެދި ކުރާ ދުޢާ",
        "text": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيـْهَا مَعَادِي، وَاجْعَلِ الـحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الـمَـوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
        "translation": ""
      }
    ],
    "06": [
      {
        "label": "ދީންމަތީ ސާބިތުކޮށްދެއްވުން އެދި ކުރާ ދުޢާ",
        "text": "اللَّهُمَّ مُصَـرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ  يَا مُقَلِّبَ القُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ",
        "translation": ""
      }
    ],
    "07": [
      {
        "label": "ކަންނެތްކަމާއި ނުކުޅަދުންތެރިކަމުން ރައްކާތެރިކޮށްދެއްވުން އެދި ކުރާ ދުޢާ",
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْـجُبْنِ وَالْـهَرَمِ، وَالْبُخْلِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْـمَـحْيَا وَالْـمَـمَاتِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ",
        "translation": ""
      }
    ],
    "08": [
      {
        "label": "ގައިބާރު ދެރަވެ މުސްކުޅި ބަލީން ރައްކާތެރިކޮށްދެއްވުން އެދި ކުރާ ދުޢާ",
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالهَـرَمِ، وَالمَأْثَمِ وَالـمَغْرَمِ، وَمِنْ فِتْنَةِ القَبْرِ وَعَذَابِ القَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الـمَـسِيْحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالبَرَدِ، وَنَقِّ قَلْبِي مِنَ الـخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الـمَـشْرِقِ وَالـمَـغْرِبِ",
        "translation": ""
      }
    ]
  },
  "footer": {
    "title": "Jamiyyath Salaf",
    "text": ""
  }
}
